//! В файле for-loop.js напиши цикл, который повторится 10 раз. Каждый раз выводи в консоль текст "ненавижу парное программирование".

for(let i = 1; i <= 10; i++) {
    console.log("ненавижу парное программирование")
}

//? В том же файле ниже напиши цикл, который повторится миллион раз. В консоль ничего выводить не нужно.

for(let i = 0; i <= 1000000; i++) {}

//* Ниже напиши цикл, который выведет в консоль числа от 0 до 100.

for(let i = 0; i <= 100; i++) {
    console.log(i)
}

// Ниже напиши цикл, который выведет в консоль числа от 500 до 1000.

for(let i = 500; i <= 1000; i++) {
    console.log(i)
}

//! Ниже напиши цикл, который выведет в консоль числа от 1000 до 0 (сначала постарайся самостоятельно, если не получится отправляйся в гугл).

for(let i = 1000; i > 0; i--) {
    console.log(i)
  }